import Image from "next/image";

export default function Bio() {
  return (
    <div className="max-w-4xl mx-auto p-8 bg-white shadow-xl rounded-lg mb-16">
      <div className="flex flex-col md:flex-row items-center md:items-start gap-6 mb-8">
        <div className="w-32 h-32 lg:w-40 lg:h-40 flex-shrink-0">
          <Image
            src="/images/selfie_gia_aboutus.jpg"
            alt="Ιάσονας Κάντας"
            width={160}
            height={160}
            className="rounded-full border-4 border-cyan-500 object-cover w-full h-full shadow-lg"
          />
        </div>
        <div>
          <h2 className="text-2xl md:text-3xl font-bold text-gray-800 mb-2">
            Ιάσονας Κάντας
          </h2>
          <p className="text-cyan-600 text-lg md:text-xl font-medium">
            Communication Strategist – 4Impact Communications Founder
          </p>
        </div>
      </div>

      <div className="space-y-6 text-gray-700 leading-relaxed text-lg">
        <p>
          Ο Ιάσονας Κάντας είναι ένας δυναμικός επαγγελματίας στον τομέα της
          επικοινωνίας και του marketing, με σημαντική εμπειρία στη στρατηγική
          επικοινωνία, την ενδυνάμωση της εταιρικής εικόνας και την ουσιαστική
          σύνδεση με τα κοινά, έχοντας πάντα ως βασικό του γνώμονα τη μεγιστοποίηση του Impact.
        </p>

        <p>
          Ως πρώην Head of Communication and Engagement Dpt στο{" "}
          <span className="font-bold">WWF Ελλάς</span>, σχεδίασε και
          υλοποίησε, με την ομάδα του, σειρά δράσεων ευαισθητοποίησης και
          συμμετοχής, ενισχύοντας την αναγνωρισιμότητα του οργανισμού και
          αυξάνοντας την αλληλεπίδραση με το κοινό σε κρίσιμα περιβαλλοντικά
          ζητήματα.
        </p>

        <p>
          Παράλληλα είχε την ευκαιρία να συνεργαστεί με άλλους οργανισμούς σε
          εθνικό και διεθνές επίπεδο, καθώς και να συν-σχεδιάσει προγράμματα με
          μεγάλες εταιρείες όπως η{" "}
          <span className="font-bold">Vodafone</span> και η{" "}
          <span className="font-bold">ΑΒ Βασιλόπουλος</span>.
        </p>

        <p>
          Επιπλέον, έχει αναπτύξει στρατηγικές επικοινωνίας για ευρωπαϊκά
          προγράμματα, όπως το LIFE, και διαθέτει εκτενή εμπειρία στη
          δημοσιογραφία σε όλες τις μορφές της και στη διαχείριση γραφείων
          τύπου, με εις βάθος γνώση του «μιντιακού τοπίου» και ένα διαρκώς
          αναπτυσσόμενο δίκτυο επαφών από τον δημοσιογραφικό χώρο. Μεγάλη του
          αγάπη παραμένει το visual storytelling και η παραγωγή πρωτότυπου
          περιεχομένου.
        </p>

        <p>
          Τα τελευταία τρία χρόνια, έχει τη χαρά να είναι μέντορας σε πεδία
          branding, επικοινωνίας και στρατηγικής μέσω του "Social Dynamo" του{" "}
          <span className="font-bold">Ιδρύματος Μποδοσάκη</span>,
          υποστηρίζοντας μικρές και ανερχόμενες οργανώσεις της Κοινωνίας των
          Πολιτών.
        </p>

        <p>
          Έχει επίσης συνεργαστεί με{" "}
          <span className="font-bold">
            το Ίδρυμα Καπετάν Βασίλη και Κάρμεν Κωνσταντακόπουλου{" "}
          </span>
          για τον σχεδιασμό στρατηγικής επικοινωνίας και με τα{" "}
          <span className="font-bold">Παιδικά Χωριά SOS</span>.
          στη διαχείριση των ΜΜΕ και τη συμβουλευτική επικοινωνίας.
        </p>

        <p>
          Με πάθος για την επικοινωνία που φέρνει πραγματική αλλαγή, πίστη στη
          δύναμη των αυθεντικών ιστοριών και της συνδιαμόρφωσης και εξειδίκευση
          στις στρατηγικές επικοινωνίας, επιμένει να σχεδιάζει και να υλοποιεί
          δράσεις που εμπνέουν, κινητοποιούν και φέρνουν πραγματικό Impact.
        </p>
      </div>
    </div>
  );
}